FormCodeGenerator/src/ExternalDataProcessors/FormGenerator/FormGenerator.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>FormGenerator</name>
  <attributes>
    <name>ИмяМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммногоДобавления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоФорм</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоРеквизитов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВоВременномХранилище</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПодключеннойОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВременногоФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйПутьКФорме</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоЭлементов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДобавленияРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДобавленияЭлементов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДобавленияКоманд</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоРеквизитовЭталон</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоЭлементовЭталон</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапущенаКакВнешняя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаОкружения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОбслуживающихМетодов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДанныхФайлаВоВременномХранилище</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеСравнениеСЭталоном</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВнешнейОбработкиВоВременномХранилище</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаКоманд</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСоздания</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСозданиеКонтекста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗаполненияСвойств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаКомандЭталон</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСоздания</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСозданиеКонтекста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗаполненияСвойств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

FormCodeGenerator/src/ExternalDataProcessors/FormGenerator/Forms/ФормаПалитра/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("РедакторФорм") Тогда
		ИмяПодключеннойОбработки = ЭтаФорма.Параметры.РедакторФорм.ИмяПодключеннойОбработки;
		Если ЭтаФорма.Параметры.РедакторФорм.ЗапущенаКакВнешняя Тогда
					ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			//ВнешниеОбработки.Создать(ИмяПодключеннойОбработки, Ложь).ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
			АдресВнешнейОбработкиВоВременномХранилище =  ЭтаФорма.Параметры.РедакторФорм.АдресВнешнейОбработкиВоВременномХранилище;
			ИмяОбработки = ВнешниеОбработки.Подключить(АдресВнешнейОбработкиВоВременномХранилище, "ВременнаяОбработкаПолученияФормыПалитры"+Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ="),  Ложь, ОбъектОписанияЗащиты);
			ВнешниеОбработки.Создать(ИмяОбработки, Ложь).ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
			//ИмяОбработки = ПереподключитьОбработку(АдресХранилища);
			//ПолучитьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма.ФормаПалитра", ПараметрыФормы);
		Иначе
			Обработки[ИмяПодключеннойОбработки].Создать().ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
